app/Controllers/Api/UserController.php

INSERT INTO `users` (`u_Account`, `u_Password`, `u_Name`, `u_r_Id`, `u_l_Id`, `u_Phone`, `u_PostalCode`, `u_Address`, `u_VerifyToken`, `u_VerifyExpires`, `u_Verified`) VALUES ('123@mail.com', '$2y$10$Bq5v91IHxR3dYrhBTtFIfev26U4P/hQ7lqL4fe6Ds1EBM2SVckvkq', 'testCus1', 4, 1, '0123456789', NULL, NULL, '79d81a70caa6be220ff4f2e1c32de51d3024dc8a7494ccca27f1b23a75013a79', '2024-12-13 12:49:00', 0)
SELECT *
FROM `users`
WHERE `users`.`u_Id` = 5
---
    public function create()
    {
        try {
            // 從請求中取得資料
            $data = [
                'u_Account' => $this->request->getVar('email'),
                'u_Password' => $this->request->getVar('password'),
                'u_Name' => $this->request->getVar('name'),
                'u_l_Id' => $this->request->getVar('locationId'),
                'u_Phone' => $this->request->getVar('phone'),
                'u_PostalCode' => $this->request->getVar('postalCode'),
                'u_Address' => $this->request->getVar('address')
            ];

            $roleId = $this->request->getVar('roleId');

            if ($roleId !== null) {
                $data['u_r_Id'] = $roleId;
            } else {
                $data['u_r_Id'] = 4;
            }

            $userId = $this->userModel->insert($data);

            if (!$userId) {
                return $this->errorResponse('建立帳號失敗');
            }

            // 取得使用者資料
            $user = $this->userModel->find($userId);