app/Models/NewsModel.php

        public function getPaginatedNews($limit, $offset)
        {
        return $this->orderBy('n_date', 'DESC')
                        ->findAll($limit, $offset);
---
SELECT *
FROM `news`
WHERE `news`.`deleted_at` IS NULL
ORDER BY `n_date` DESC
 LIMIT 4

        public function getTotalNews()
        {
        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `news`
WHERE `news`.`deleted_at` IS NULL