app/Models/UserModel.php

    public function getByAccount(string $account)
    {
        return $this->where('u_Account', $account)
            ->select('users.*,roles.r_Name')
            ->join('roles', 'roles.r_Id = users.u_r_Id')
            ->first();
---
SELECT `users`.*, `roles`.`r_Name`
FROM `users`
JOIN `roles` ON `roles`.`r_Id` = `users`.`u_r_Id`
WHERE `u_Account` = 't80422@gmail.com'
 LIMIT 1